---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
source: html/70a3395b-c9b9-7033-f128-a2c2c0f92c6b.htm
---
# StructuralConnectionApprovalType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.